import { Fragment } from "react";

import classes from "../styles/Tafahom.module.css";

const items = [
  {
    title: "ارسال سفارش ها",
    dec1: `
    خدمات «میاره» بر پایه ارسال سفارش‌های محلی به شکل مرسولات تندمصرف مانند «کالاهای فروشگاهی، خوراک گرم و سرد، دارو، غذای حیوانات، نان، میوه و سبزیجات» تعریف شده است و برای ارسال سفارش‌های دیگر مانند اسناد و مدارک، وجه نقد و غیره، قابل استفاده نیست.
    `,
    dec2: `
    «میاره» صرفا وظیفه انتقال سفارش از محل مشتری به محل گیرنده را بر عهده دارد و هیچ مسئولیتی در قبال کیفیت، کمیت و سلامت سفارش ندارد.
    `,
    dec3: `
    مشتریان خدمات «میاره» متعهد هستند ضوابط و مقررات لازم و تعیین‌شده توسط نهادهای قانونی مانند: نیروی انتظامی، وزارت بهداشت درمان و آموزش پزشکی یا سایر مراجع قانونی و ذی‌ربط را به‌طور کامل اجرا کنند و «میاره» مسئولیتی در قبال محتوای سفارش‌ها ندارد.`,
  },
  {
    title: "سفر",
    dec1: `یک سفر یعنی یک‌بار مراجعه سفیر موتوری به مشتری و دریافت ۱ الی ۳ سفارش و تحویل آن به ۱ تا ۳ گیرنده مختلف.

    `,
    dec2: `هزینه سفر مستقل از هزینه اشتراک هفتگی یا ماهانه ظرفیت است و پس از اتمام سفر هزینه سفر به صورت خودکار از پنل مشتری کسر می‌شود.`,
    dec3: `خدمات «میاره» بر پایه ارسال سفارش به صورت محلی تا (شعاع ۲ کیلومتر هوایی از مبدا) تعریف شده و در صورت ارسال به مناطق خارج از این محدوده، هزینه مسیر طبق استاندارد مشخص، به هزینه سفر افزوده می‌شود.`,
  },
  {
    title: "پرداخت خسارت",
    dec1: `«میاره» در قبال خسارت‌های وارد شده به کسب‌وکار مشتری به هر شکل، شامل کیفیت سفر و شرایط دریافت و حمل و تحویل سفارش، فاقد مسئولیت قانونی است و جبران خسارت به مشتری، تنها بر اساس شرایط تعهد کیفیت خدمات «میاره» و در راستای مشتری‌مداری انجام می‌شود. این خسارت‌ها بر اساس نظر کارشناسی واحد پشتیبانی «میاره» برآورد می‌شود.`,
    dec2: ``,
    dec3: ``,
  },
  {
    title: "تعهد کیفیت خدمات SLA",
    dec1: `تضمین کیفیت سرویس یا «Service-Level-Agreement» در «میاره» بر پایه شاخص‌های تعهد به کیفیت خدمات تعریف می‌شود. «میاره» متعهد است در هر هفته برای حداقل ۹۰٪ سرویس‌ها در زمان کمتر از ۲۰ دقیقه پس از ثبت درخواست و تا ۵۰ دقیقه در شرایط ویژه، سفیر موتوری را برای انجام سفارش به محل مشتری اعزام کند.`,
  },
  {
    title: "زمانبدی خدمات",
    dec1: `دسترسی سایت ارائه سرویس «میاره» و ثبت درخواست در روزهای عادی، از ساعت ۸:۱۵ صبح تا ۲۳:۴۵ شب امکان‌پذیر است. زمان فعالیت برای مشتریان به سه شیفت تقسیم می‌شود.`,
    dec2: `شیفت صبح: از ساعت ۸:۱۵ تا ۱۱

    
    `,
    dec3: `شیفت ظهر: از ساعت ۱۱:۰۰ تا ۱۷:۳۰`,
    dec4: `شیفت شب: از ساعت ۱۷:۳۰ تا ۲۳:۴۵`,
  },
];

function Tafahom() {
  return (
    <Fragment>
      <div className={classes["main-taf"]}>
        <div className={classes["taf-header"]}>
          <h1>تفاهم‌نامه پلتفرم «میاره»</h1>
          <p>
            سرویس ارسال سریع «میاره» از طریق وب‌سایت www.miare.ir به مشتریان
            ارائه می‌شود. تمامی کاربران با ثبت‌نام در «میاره» و استفاده از خدمات
            آن، می‌پذیرند که شرایط و قوانین موجود را به صورت کامل مطالعه کرده و
            نسبت به تمام موارد آن، آگاهی کامل دارند.
          </p>
        </div>
        {items.map((item) => (
          <div className={classes["taf-card"]}>
            <h1>{item.title}</h1>
            <p>{item.dec1}</p>
            <p>{item.dec2}</p>
            <p>{item.dec3}</p>
            <p>{item.dec4}</p>
          </div>
        ))}
      </div>
    </Fragment>
  );
}

export default Tafahom;
